# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Trenton\Desktop\School Stuff\Junior Year (2013-2014)\Spring 2014\Microcontrollers\Dual_Starblast.cydsn\Dual_Starblast.cyprj
# Date: Tue, 13 May 2014 23:31:27 GMT
#set_units -time ns
create_clock -name {GLCD_SPIM_SCB_SCBCLK(FFB)} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_generated_clock -name {GLCD_SPIM_SCB_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 2 3} [list]
create_generated_clock -name {Com_Block_IntClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 13 25} [list [get_pins {ClockBlock/udb_div_0}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]


# Component constraints for C:\Users\Trenton\Desktop\School Stuff\Junior Year (2013-2014)\Spring 2014\Microcontrollers\Dual_Starblast.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Trenton\Desktop\School Stuff\Junior Year (2013-2014)\Spring 2014\Microcontrollers\Dual_Starblast.cydsn\Dual_Starblast.cyprj
# Date: Tue, 13 May 2014 23:31:23 GMT
